<div class="article__body">
  <?php the_content(); ?>
  <h2>asdf</h2>
  <p>最後にひとつだけ、前述のような領域を広げるアプローチではなく、さらにUIへの理解を深めたい人や、UIと名のつく本は読み尽くした人への本をご紹介。<br>
  こちらはビジュアルデザイン的なシンボルのような記号の意味ではなく、<strong>インターフェイス全般を扱うために</strong>必要な言語における意味性と記号表現について紹介されています。<br>
  具体的なモノではなく、今後より抽象的な概念と併せてUIを考えていく際の基礎として役立つ本です。</p>
  <h3>asdf</h3>
  <h4>asdf</h4>
  <p>最後にひとつだけ、前述のような領域を広げるアプローチではなく、さらにUIへの理解を深めたい人や、UIと名のつく本は読み尽くした人への本をご紹介。<br>
  こちらはビジュアルデザイン的なシンボルのような記号の意味ではなく、インターフェイス全般を扱うために必要な言語における意味性と記号表現について紹介されています。<br>
  具体的なモノではなく、今後より抽象的な概念と併せてUIを考えていく際の基礎として役立つ本です。</p>
  <a href="#" class="article__book-container">
    <img class="article__book__img" src="<?php bloginfo('template_url'); ?>/images/sample_book.jpg" alt="">
    <div class="article__book-inner">
      <span class="article__book__title">さよなら、インタフェース -脱「画面」の思考法さよなら、インタフェース -脱「画面」の思考法</span>
      <span class="article__book__author">ゴールデン・クリシュナ</span>
      <span class="article__book__desc">時代はNoUI(ノー・ユーアイ)ヘ。目的を達成するための手段であるはずなのに、
いつのまにか、手段を設計することが目的になってはいないか?
何にでもとりあえず画面をくっつけて、
その長方形の中をどう設計するかということにばかり考えを巡らせて、
本当に人のためになるシステムを創るということが疎かになってはいないか?

本書では、「ベストなインタフェースはノー・インタフェース」をコンセプトに、余計な操作を強いる「画面」をこの際とっぱらって、人々の暮らしに自然と溶け込む製品やサービスを創り出そうじゃないかと主張しています。</span>
    </div>
  </a>
  <h4>asdf</h4>
  <p>最後にひとつだけ、前述のような領域を広げるアプローチではなく、さらにUIへの理解を深めたい人や、UIと名のつく本は読み尽くした人への本をご紹介。<br>
  こちらはビジュアルデザイン的なシンボルのような記号の意味ではなく、<strong>インターフェイス全般を扱うために</strong>必要な言語における意味性と記号表現について紹介されています。<br>
  具体的なモノではなく、今後より抽象的な概念と併せてUIを考えていく際の基礎として役立つ本です。</p>
  <h3>asdf</h3>
  <h4>asdf</h4>
  <p>最後にひとつだけ、前述のような領域を広げるアプローチではなく、さらにUIへの理解を深めたい人や、UIと名のつく本は読み尽くした人への本をご紹介。<br>
  こちらはビジュアルデザイン的なシンボルのような記号の意味ではなく、インターフェイス全般を扱うために必要な言語における意味性と記号表現について紹介されています。<br>
  具体的なモノではなく、今後より抽象的な概念と併せてUIを考えていく際の基礎として役立つ本です。</p>
  <div class="code-wrapper">
    <div class="code-inner">
      <span class="lang-label">Ruby</span>
      <pre><code class="ruby">
if user_signed_in? && current_user.admin?
@users = User.where(
is_registerd: true,
gender: User.genders[:male],
).order(created_at: :desc)
end
      </code></pre>
    </div>
  </div>
  <blockquote>hogehoge</blockquote>
  <h2>asdf</h2>
  具体的なモノではなく、今後より抽象的な概念と併せてUIを考えていく際の基礎として役立つ本です。</p>
  <h3>asdf</h3>
  <h4>asdf</h4>
  具体的なモノではなく、今後より抽象的な概念と併せてUIを考えていく際の基礎として役立つ本です。</p>
  <h4>asdf</h4>
  <p>最後にひとつだけ、前述のような領域を広げるアプローチではなく、さらにUIへの理解を深めたい人や、UIと名のつく本は読み尽くした人への本をご紹介。<br>
  こちらはビジュアルデザイン的なシンボルのような記号の意味ではなく、インターフェイス全般を扱うために必要な言語における意味性と記号表現について紹介されています。<br>
  具体的なモノではなく、今後より抽象的な概念と併せてUIを考えていく際の基礎として役立つ本です。</p>
</div>
